# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv("file1.csv")
df2 = pd.read_csv("file2.csv")
df3 = pd.read_csv("file3.csv")

df3.head() #I see that df3's state and gender columns have another name from those of df2 and 3. Let's rename the columns to posteriorly concat all the dfs.

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [3]:
df3.rename(columns={"State": "ST","Gender": "GENDER"}, inplace = True)
df3.head()

,Customer,ST,Customer Lifetime Value,Education,GENDER,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [4]:
df4 = pd.concat([df1, df2, df3], axis=0, keys=["df1", "df2", "df3"]) #concatenating the 3 dfs into a new table (one on top of the other)
df4.head()

      Customer          ST GENDER             Education  \
df1 0  RB50392  Washington    NaN                Master
    1  QZ44356     Arizona      F              Bachelor
    2  AI49188      Nevada      F              Bachelor
    3  WW63253  California      M              Bachelor
    4  GA49547  Washington      M  High School or Below

      Customer Lifetime Value   Income  Monthly Premium Auto  \
df1 0                     NaN      0.0                1000.0
    1              697953.59%      0.0                  94.0
    2             1288743.17%  48767.0                 108.0
    3              764586.18%      0.0                 106.0
    4              536307.65%  36357.0                  68.0

      Number of Open Complaints     Policy Type  Vehicle Class  \
df1 0                    1/0/00   Personal Auto  Four-Door Car
    1                    1/0/00   Personal Auto  Four-Door Car
    2                    1/0/00   Personal Auto   Two-Door Car
    3                    1/0/00  Corporate Auto            SUV
    4                    1/0/00   Personal Auto  Four-Door Car

       Total Claim Amount
df1 0            2.704934
    1         1131.464935
    2          566.472247
    3          529.881344
    4           17.269323

In [5]:
#applying the cleaning functionsd from the other lab to the df4:
df4.rename(columns={"Customer": "customer",
                   "ST": "state",
                   "GENDER": "gender",
                   "Education": "education",
                   "Customer Lifetime Value": "customer_lifetime_value",
                   "Income": "income",
                   "Monthly Premium Auto": "monthly_premium_auto",
                   "Number of Open Complaints": "number_of_open_complaints",
                   "Policy Type": "policy_type",
                   "Vehicle Class": "vehicle_class",
                   "Total Claim Amount": "total_claim_amount",},
                   inplace = True
                   )

def gender_consistency(genders):
    if genders == "M":
        return "M"
    if genders == "Male":
        return "M"
    if genders == "F":
        return "F"
    if genders == "Femal":
        return "F"
    if genders == "female":
        return "F"
    else:
        return np.nan
df4["gender"].apply(gender_consistency)


def state_consistency(states):
    if states == "AZ":
        return states.replace("AZ", "Arizona")
    if states == "WA":
        return states.replace("WA", "Washington")
    if states == "Cali":
        return states.replace("Cali", "California")
    else:
        return np.nan

df4["state"].apply(state_consistency)

def education_consistency(title):
    if title == "Bachelors":
        return title.replace("Bachelors", "Bachelor")
    if title == "College":
        return title.replace("College", "Bachelor")
    else:
        return np.nan

df4["state"].apply(state_consistency)

def education_consistency(title):
    if title == "Bachelors":
        return title.replace("Bachelors", "Bachelor")
    if title == "College":
        return title.replace("College", "Bachelor")
    else:
        return np.nan

df4["education"].apply(education_consistency)

def vehicle_class_consistency(vehicle):
    if vehicle == "Sports Car":
        return vehicle.replace("Sports Vehicle", "Luxury")
    if vehicle == "Luxury SUV":
        return vehicle.replace("Luxury SUV", "Luxury")
    if vehicle == "Luxury Car":
        return vehicle.replace("Luxury Car", "Luxury")

df4["vehicle_class"].apply(vehicle_class_consistency)

#Deleting the % in customer_life_value:
df4['customer_lifetime_value'] = df4['customer_lifetime_value'].apply(lambda x: str(x).rstrip('%')).astype(float) /100.0

df4["customer_lifetime_value"] = df4["customer_lifetime_value"].round(2) #Formatting the CLV from string to float and rounding to 2 decimals.

def complaints_cleaner(complain):
    complain = str(complain)
    parts = complain.split('/')
    if len(parts) == 3:
        return parts[1]
    return complain

df4["number_of_open_complaints"] = df4["number_of_open_complaints"].astype(str).apply(complaints_cleaner)

In [6]:
#handling null values:
#Deleting rows that contain null values in all columns:
df4.dropna(axis=0, how="all", inplace=True)

df4.info() #after doing this, I see that there are 12074 entries. However in most rows i vave 9137 non-nulls and I have other columns that have 7070 or 2067...

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 12074 entries, ('df1', np.int64(0)) to ('df3', np.int64(7069))
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   9137 non-null   object
 1   state                      9137 non-null   object
 2   gender                     9015 non-null   object
 3   education                  9137 non-null   object
 4   customer_lifetime_value    9130 non-null   float64
 5   income                     9137 non-null   float64
 6   monthly_premium_auto       9137 non-null   float64
 7   number_of_open_complaints  12074 non-null  object
 8   policy_type                9137 non-null   object
 9   vehicle_class              9137 non-null   object
 10  total_claim_amount         9137 non-null   float64
dtypes: float64(4), object(7)
memory usage: 1.4+ MB

In [7]:
#let's go column by column and see what is happening:
df4.isna().sum() #by doing this, I see that the gender column has 122 NaN and the CVL has 7.

customer                     2937
state                        2937
gender                       3059
education                    2937
customer_lifetime_value      2944
income                       2937
monthly_premium_auto         2937
number_of_open_complaints       0
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [8]:
#Handling gender: replacing the NaNs for the most frequent value (mode):
df4["gender"].fillna(df4["gender"].mode()[0], inplace=True)
#handling CLV: replacing the NaNs for the CLV mean:
df4["customer_lifetime_value"].fillna(df4["customer_lifetime_value"].mean(), inplace=True)
df4.isna().sum() #after this, I see that I have no more NaN values

/var/folders/m3/cvmhd4j11f7968wyg9z4qfdr0000gn/T/ipykernel_1481/2931686352.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df4["gender"].fillna(df4["gender"].mode()[0], inplace=True)
/var/folders/m3/cvmhd4j11f7968wyg9z4qfdr0000gn/T/ipykernel_1481/2931686352.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df4["customer_lifetime_value"].fillna(df4["customer_lifetime_value"].mean(), inplace=True)

customer                     2937
state                        2937
gender                          0
education                    2937
customer_lifetime_value         0
income                       2937
monthly_premium_auto         2937
number_of_open_complaints       0
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [9]:
#Let's check now for duplicated rows:
df4.duplicated().sum() #I see that I have 3 duplicated rows. Let's keep the first one and eliminate the other 2:
df4.drop_duplicates(keep="first", inplace=True)
df4.duplicated().sum() #now, it's 0. :D

np.int64(0)

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [10]:
df5 = pd.read_csv("marketing_customer_analysis_clean.csv")
df5.columns

Index(['unnamed:_0', 'customer', 'state', 'customer_lifetime_value',
       'response', 'coverage', 'education', 'effective_to_date',
       'employmentstatus', 'gender', 'income', 'location_code',
       'marital_status', 'monthly_premium_auto', 'months_since_last_claim',
       'months_since_policy_inception', 'number_of_open_complaints',
       'number_of_policies', 'policy_type', 'policy', 'renew_offer_type',
       'sales_channel', 'total_claim_amount', 'vehicle_class', 'vehicle_size',
       'vehicle_type', 'month'],
      dtype='object')

In [11]:
df5["customer_lifetime_value"] = df5["customer_lifetime_value"].round(2) #rounding the column to 2 decimals

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [12]:
df5.pivot_table(
    values = "customer_lifetime_value",
    index = "sales_channel",
    aggfunc = "sum"
)

               customer_lifetime_value
sales_channel
Agent                      33057887.66
Branch                     24359201.28
Call Center                17364288.35
Web                        12697633.04

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [13]:
pivot_table = df5.pivot_table(
    values = "customer_lifetime_value",
    index = ["gender", "education"],
    aggfunc = "mean"
)
pivot_table = pivot_table.round(2)
print(pivot_table)

                             customer_lifetime_value
gender education
F      Bachelor                              7874.27
       College                               7748.82
       Doctor                                7328.51
       High School or Below                  8675.22
       Master                                8157.05
M      Bachelor                              7703.60
       College                               8052.46
       Doctor                                7415.33
       High School or Below                  8149.69
       Master                                8168.83

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [15]:
pivot_table = df5.pivot_table(
    values = "number_of_open_complaints",
    index = ["policy_type", "month"],
    aggfunc = "count"
)
print(pivot_table)

                      number_of_open_complaints
policy_type    month
Corporate Auto 1                           1252
               2                           1089
Personal Auto  1                           4329
               2                           3799
Special Auto   1                            237
               2                            204